system_crafters/emacs.org
#+title Emacs From Scratch Configuration

this adds the tangle parameter to all lisp code blocks in the file
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

when adding a property like the above, it needs to be re-evaluated
before taking effect re-evaluate by putting the cursor on that line
and pressing =C-c C-c= or by running =M-x org-mode=

* function definitions
** window-split-toggle
Toggle between horizontal and vertical split with two windows.  and
only two windows

#+begin_src emacs-lisp

(defun window-split-toggle ()
  (interactive)
  (if (> (length (window-list)) 2)
      (error "Can't toggle with more than 2 windows!")
    (let ((func (if (window-full-height-p)
                    #'split-window-vertically
                  #'split-window-horizontally)))
      (delete-other-windows)
      (funcall func)
      (save-selected-window
        (other-window 1)
        (switch-to-buffer (other-buffer))))))

#+end_src

** org-mode-setup

procedure to setup org mode

(I think he did it this way only to show how functions work in emacs)

#+begin_src emacs-lisp

(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode)
)

#+end_src

* Emacs From Scratch by David Willson
** youtube playlist
https://www.youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ
** Github page current
https://github.com/daviwil/emacs-from-scratch
** daviwil's configuration
https://github.com/daviwil/dotfiles/blob/master/Emacs.org
* DONE Emacs From Scratch #1 - Getting Started with a Basic Usable Configuration
https://www.youtube.com/watch?v=74zOY-vgkyw&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&index=1
** describe commands
by default =C-h= host the help commands

notable sub items of that are:
=describe-function=
=describe-variable=
=describe-key=

** Package sources

adds extra repositories of packages

#+begin_src emacs-lisp

; initialize package sources
(require 'package)

;; sets the links to the package repositories
(setq package-archives '(
                         ("melpa" . "https://melpa.org/packages/")
                         ("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")
                        )
)
#+end_src

*** initialize use-package

initialize use-package on non-linux platforms

it's checking if use-package is installed if it's not it installs it

#+begin_src emacs-lisp
  
  ;; loads emacs packages and activate them
  (package-initialize)
  
  ;; check if package-archive-contents is present
  ;; if there are no pachage archive (downloaded packages)
  ;; on the computer, download them
  (unless package-archive-contents
   (package-refresh-contents))
  
  ;; tries to install use-package if it's not already installed
  (unless (package-installed-p 'use-package)
    (package-install 'use-package)
  )
  
  ;; loads use-package package
  (require 'use-package)
  
  ;; use-package-always-ensure makes it so
  ;; when require is used on a package
  ;; if the package is not downloaded
  ;; it will download it before
  ;; activating it
  (setq use-package-always-ensure t)
  ;; Enable use-package-always-ensure
  ;; if you wish this behavior to be
  ;; global for all packages:
  ;;
  ;; https://github.com/jwiegley/use-package
  
#+end_src

** Basic UI configuration
*** inhibit startup message

removes the startup message,
the one with the emacs logo and links
 
#+begin_src emacs-lisp

  (setq inhibit-startup-message t)
  
#+end_src

*** hides extra UI elements

#+begin_src emacs-lisp

  (scroll-bar-mode -1) ; disable visible scrollbar
  (tool-bar-mode -1) ; disable the toolbar
  (tooltip-mode -1) ; disable tooltips
  (menu-bar-mode -1) ; disable the menu bar
 
 
#+end_src

*** fringes configuration

On graphical displays, each Emacs window normally has narrow fringes
on the left and right edges. The fringes are used to display symbols
that provide information about the text in the window.

documentation:
https://www.gnu.org/software/emacs/manual/html_node/emacs/Fringes.html#:~:text=14.14%20Window%20Fringes,or%20to%20modify%20their%20width.

#+begin_src emacs-lisp
  
  (set-fringe-mode 10) ; give some breathin room?

#+end_src

*** visual bell

when you try to do an action that can't be done
emacs will flash the screen

#+begin_src emacs-lisp

(setq visible-bell t)
  
#+end_src

*** Font Configuration

#+begin_src emacs-lisp

  (set-face-attribute 'default nil
                      :font "Fira Code"
                      :height 140
  )

  ;; set the fixed pitch font face
  (set-face-attribute 'fixed-pitch nil
                      :font "Fira Code"
                      :height 140
  )

  ;; set hte variable pitch font face
  (set-face-attribute 'variable-pitch nil
                      :font "Prociono"
                      :height 150
                      :weight 'regular
                      )

#+end_src
*** theme

sets dracula as the default theme

to choose a theme afterwards:
=M-x counsel-load-theme= 

#+begin_src emacs-lisp

(use-package doom-themes)
(load-theme 'doom-dracula t) 

#+end_src

** command-log mode

shows a buffer on the right side of the screen with the keybindings
that are pressed with the command that is invoked

to activate it use =M-x global-command-log-buffer= and then for it to
appear: =clm/toggle-command-log-buffer= if you press =ESC= it goes away

this is more useful for him to help in the video, but can be useful for me too

#+begin_src emacs-lisp

(use-package command-log-mode)

#+end_src

** Ivy

one of the 2 completion frameworks for emacs the other is helm you can
use both at the same time

#+begin_src emacs-lisp

(use-package ivy
  ;; diminish hides the minor mode 
  ;; from the modeline
  :diminish
  :bind (
	 ("M-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill)
	)
  :config
  (ivy-mode 1)
)

#+end_src

** Counsel

#+begin_src emacs-lisp

(use-package counsel
  :ensure t)

#+end_src

*** counsel-find-file

shows the files in the directory in the minibuffer

*** sounsel-switch-buffer

shows the currently open buffers and lets you choose which one to switch to

** Keyboard behavior
*** Make ESC quit prompts

#+begin_src emacs-lisp

(global-set-key
 (kbd "<escape>") 'keyboard-escape-quit
)

#+end_src

** doom modeline

#+begin_src emacs-lisp

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom (
	      (doom-modeline-height 10)
	    )
)

#+end_src

** tips and tricks
*** M-x

M stants for =meta= which nowadays means the Alt key

the M-x keybinding by default binds to =run command=

with it you can run any command programmed in Emacs
including all of the commands from packages installed
* DONE Emacs From Scratch #2 - Adding Helpful UI Improvements
https://www.youtube.com/watch?v=IspAZtNTslY&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&index=2
** line numbers

#+begin_src emacs-lisp
  
  (column-number-mode)
  (global-display-line-numbers-mode t)

#+end_src

*** disable line number for some modes

#+begin_src emacs-lisp
  
  (dolist
    (mode '(org-mode-hook
            term-mode-hook
            shell-mode-hook
            eshel-mode-hook
           )
    )
    (add-hook mode (lambda ()
                   (display-line-numbers-mode 0)
                   )
    )
  )
  
#+end_src

** rainbow delimeters

#+begin_src emacs-lisp
  
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** which-key

starts a panel pop up when you start to type a keybinding

showing which keys are avainlable under that keybinding/prefix

shows information on the commands that can be pressed after you press
a key prefix, like =C-x= shows the keybindings for available commands
and shows the name of the command

#+begin_src emacs-lisp

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config (setq which-key-idle-delay 0)
)

#+end_src

** init and config keywords in lisp

:config and :init are two sides of the kind of code you want to run
when this package gets loaded

init happens before the package is loaded, allowing to do
preconfiguration for the package like setting variables
also allowing to invoke the mode itself

** ivy rich 

more details on completions from ivy

#+begin_src emacs-lisp
  
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1)
  )
  
#+end_src

** counsel
use counsel instead of the default emacs minibuffer prompts, counsel
gives more information

#+begin_src emacs-lisp
  
  (use-package counsel
    :bind (
           ("M-x" . counsel-M-x)
           ("C-x b" . counsel-buffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)
          )
    :config
  )
  
#+end_src

** helpful

#+begin_src emacs-lisp

(use-package helpful
  :ensure t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-callable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key)
)

#+end_src

** doom-themes
already added at part 1
* TODO Emacs From Scratch #3 - Key Bindings and Evil

** all the icons

the first time you load your configuration on a new machine, you'll
need to run the following command so that the icons are downloaded and
displayed correctly

=M-x all-the-icons-install-fonts=

#+begin_src emacs-lisp

(use-package all-the-icons)

#+end_src


