system_crafters/init.el
(defun window-split-toggle ()
  (interactive)
  (if (> (length (window-list)) 2)
      (error "Can't toggle with more than 2 windows!")
    (let ((func (if (window-full-height-p)
                    #'split-window-vertically
                  #'split-window-horizontally)))
      (delete-other-windows)
      (funcall func)
      (save-selected-window
        (other-window 1)
        (switch-to-buffer (other-buffer))))))

(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode)
)

; initialize package sources
(require 'package)

;; sets the links to the package repositories
(setq package-archives '(
                         ("melpa" . "https://melpa.org/packages/")
                         ("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")
                        )
)

;; loads emacs packages and activate them
(package-initialize)

;; check if package-archive-contents is present
;; if there are no pachage archive (downloaded packages)
;; on the computer, download them
(unless package-archive-contents
 (package-refresh-contents))

;; tries to install use-package if it's not already installed
(unless (package-installed-p 'use-package)
  (package-install 'use-package)
)

;; loads use-package package
(require 'use-package)

;; use-package-always-ensure makes it so
;; when require is used on a package
;; if the package is not downloaded
;; it will download it before
;; activating it
(setq use-package-always-ensure t)
;; Enable use-package-always-ensure
;; if you wish this behavior to be
;; global for all packages:
;;
;; https://github.com/jwiegley/use-package

(setq inhibit-startup-message t)

(scroll-bar-mode -1) ; disable visible scrollbar
(tool-bar-mode -1) ; disable the toolbar
(tooltip-mode -1) ; disable tooltips
(menu-bar-mode -1) ; disable the menu bar

(set-fringe-mode 10) ; give some breathin room?

(setq visible-bell t)

(set-face-attribute 'default nil
                    :font "Fira Code"
                    :height 140
)

;; set the fixed pitch font face
(set-face-attribute 'fixed-pitch nil
                    :font "Fira Code"
                    :height 140
)

;; set hte variable pitch font face
(set-face-attribute 'variable-pitch nil
                    :font "Prociono"
                    :height 150
                    :weight 'regular
                    )

(use-package doom-themes)
(load-theme 'doom-dracula t)

(use-package command-log-mode)

(use-package swiper
  :ensure t)

(use-package ivy
  ;; diminish hides the minor mode 
  ;; from the modeline
  :diminish
  :bind (
	 ("M-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill)
	)
  :config
  (ivy-mode 1)
)

(use-package counsel
  :ensure t)

(global-set-key
 (kbd "<escape>") 'keyboard-escape-quit
)

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom (
	      (doom-modeline-height 10)
	    )
)

(column-number-mode)
(global-display-line-numbers-mode t)

(dolist
  (mode '(org-mode-hook
          term-mode-hook
          shell-mode-hook
          eshel-mode-hook
         )
  )
  (add-hook mode (lambda ()
                 (display-line-numbers-mode 0)
                 )
  )
)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config (setq which-key-idle-delay 0)
)

(use-package ivy-rich
  :init
  (ivy-rich-mode 1)
)

(use-package counsel
  :bind (
         ("M-x" . counsel-M-x)
         ("C-x b" . counsel-buffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)
        )
  :config
)

(use-package helpful
  :ensure t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-callable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key)
)

(use-package all-the-icons)
