system_crafters/emacs.org
** general.el keybindings

general.el provides a more convenient method for binding keys in emacs
(for both evil and non-evil users).

#+begin_src emacs-lisp
 
(use-package general)	  

;; (general-define-key
 ;; it can be a list of 
 ;; keybindings also:
 ;; "C-M-k" 'some-function
 ;; "C-M-j" 'counsel-switch-buffer
;; )

#+end_src

he doesn't use general.el this way the way he uses it is to maintain a
global key prefix like <space> in spacemacs to od this you call
=(general-create-definer ...)=

#+begin_src emacs-lisp

  (use-package general
    :config
    (general-create-definer rune/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
  
    (rune/leader-keys
     "t" '(
           :ignore t
           :which-key "toggles"
           )
     "tt" '(counsel-load-theme :which-key "choose theme")
     "fs" '(save-buffer :which-key "save buffer")
     "ss" '(swiper :which-key "search")
     ":" '(counsel-M-x :which-key "run command")
     "ff" '(counsel-find-file :which-key "find file")
     ";" '(eval-last-sexp :which-key "eval expression")
     "TAB" '(counsel-switch-buffer :which-key "switch buffer")
     "bd" '(kill-buffer :which-key "delete buffer")
     "bk" '(kill-buffer :which-key "kill buffer")
     "bn" '(next-buffer :which-key "next buffer")
     "bp" '(previous-buffer :which-key "previous buffer")
     "qq" '(save-buffers-kill-emacs :which-key "quit emacs")
  
     ;; not working?
     "tw" '(window-split-toggle :which-key "toggle window split h/v")
    )
  )
  
#+end_src

* my own config
** keybindings for closing emacs

* swiper

Swiper is the interactive find I've been using with =SPC s s=

got the following error because, he had the package installed already
in his computer and I didn't

command-execute: Autoloading file /.../ivy.elc failed to define
function swiper needed to install swiper for the error to go away

#+begin_src emacs-lisp

(use-package swiper
  :ensure t)


#+end_src

* Keyboard behavior
** bind save buffer
rebinding save-buffer

#+begin_src emacs-lisp

(global-set-key (kbd "C-s") 'save-buffer)

#+end_src

* evil-mode
vim keybindings in emacs

#+begin_src emacs-lisp

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1) 
  ;; bind keys only in insert mode
  ;; (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  ;; (define-key-evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;;use visual line motions even outside of visual-line-mode buffers 
  ;; AH! this is a config that I noticed changing in doom-emacs
  ;;
  ;; it makes the cursor interpret warpped-around lines as more than one line
  ;;
  ;; by default the warpped line is considered one line until the very end
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  ;;strangelly_it_is_not_working

  ;; (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard 'normal)
)

  ;; IMPORTANT! C-z puts you in emacs-mode
  ;; a mode where evil-keybindings don't work
  ;; I struggled with that in the past


#+end_src

* evil-collection
collection of evil keybindings for different and many buffers/major
modes/parts of emacs

#+begin_src emacs-lisp

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init)) 

#+end_src

* hydra

allows to set transient keybindings (temporary keybindings)

This is a package for GNU Emacs that can be used to tie related
commands into a family of short bindings with a common prefix - a
Hydra.

#+begin_src emacs-lisp

(use-package hydra) 

(defhydra hydra-text-scale (
			    :timeout 5
			   )
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t)
)

(rune/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

* projectile

Projectile is a project interaction library for Emacs.

#+begin_src emacs-lisp

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects"))
  )
  (setq projectile-switch-project-action #'projectile-dired)
)

(use-package counsel-projectile
  :config (counsel-projectile-mode)
)

#+end_src

* magit

#+begin_src emacs-lisp

(use-package magit

  ;; makes the diff window 
  ;; happen in the same window you are in
  ;; the defalt is showing another window
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-windows-except-diff-v1)
)

#+end_src

* forge

"offshoot" of magit it lets you pull down all the information from a
particular git repository like issues and pull requests, you can
manipulate those inside emacs.  like responding to comments from
github issues in emacs

forge needs authentication with github check the project page /
website for info on how to setup

#+begin_src emacs-lisp

(use-package forge)

#+end_src

* Org Mode
** initial config

#+begin_src emacs-lisp

(use-package org
  :hook (org-mode . efs/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"
	;; the following config 
;; hide the formatting tags like *word* 
	org-hide-emphasis-markers t
  )
)

#+end_src

** org-appear

from davewill's config:

This package makes it much easier to edit Org documents when
org-hide-emphasis-markers is turned on.  It temporarily shows the
emphasis markers around certain markup elements when you place your
cursor inside of them. No more fumbling around with = and *
characters!

(not really working at the moment)

#+begin_src emacs-lisp

(use-package org-appear
  :hook (org-mode . org-appear-mode))

#+end_src

** org-bullets
package: org-bullets makes the bullets on headlines look nicer by
default it starts nice, but as there is more indentation the symbols
start to get a bit weird

code below giving error: error: Invalid face, org-level-1

#+begin_src emacs-lisp

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
;; his lame bullets
;;  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")
  (org-bullets-bullet-list '(
			     "➀"
			     "➁"
			     "➂"
			     "➃"
			     "➄"
			     "➅"
			     "➆"
			     "➇"
			     "➈"
			     "➉"
			     )
  )
)

#+end_src

** faces(fonts) for heading levels

#+begin_src emacs-lisp

(use-package org
  :config

    (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
			    '(("^ *\\([-]\\) "
				(0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
		    (org-level-2 . 1.1)
		    (org-level-3 . 1.05)
		    (org-level-4 . 1.0)
		    (org-level-5 . 1.1)
		    (org-level-6 . 1.1)
		    (org-level-7 . 1.1)
		    (org-level-8 . 1.1)))
	(set-face-attribute (car face) nil :font "Prociono" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    )

  (efs/org-font-setup)

;; replace list of hiphens with a dot
(font-lock-add-keywords 'org-mode
			'(
			  ("^ *\\([-]\\) "
			   (0 (prog1 ()
				(compoese-region (match-beginning 1)
						 (match-end 1)
						 "•"
						 )
			      )
			   )
			  )
			 )
)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil
		    :foreground nil
		    :inherit 'fixed-pitch
		    )

(set-face-attribute 'org-code nil
		    :inherit '(shadow fixed-pitch)
		    )

(set-face-attribute 'org-table nil
		    :inherit '(shadow fixed-pitch)
		    )

(set-face-attribute 'org-verbatim nil
		    :inherit '(shadow fixed-pitch)
		    )

(set-face-attribute 'org-special-keyword nil
		    :inherit '(font-lock-comment-face fixed-pitch)
		    )

(set-face-attribute 'org-meta-line nil
		    :inherit '(font-lock-comment-face fixed-pitch)
		    )

(set-face-attribute 'org-checkbox nil
		    :inherit 'fixed-pitch
		    )

;; davewill's config:
;;    (dolist (face '((org-level-1 . 1.5)
;;		    (org-level-2 . 1.45)
;;		    (org-level-3 . 1.4)
;;		    (org-level-4 . 1.35)
;;		    (org-level-5 . 1.3)
;;		    (org-level-6 . 1.25)
;;		    (org-level-7 . 1.2)
;;		    (org-level-8 . 1.1)
;;		)
;;	    )
;;      )
;;
;;  (set-face-attribute (car face) nil
;;		      :font "Prociono"
;;		      :weight 'regular
;;		      :height (cdr face)
;;  )
)

#+end_src

