system_crafters/emacs.org
** visual-fill-column

Visual Fill Column is a small Emacs minor mode that mimics the effect
of FillColumn in VisualLineMode.

Instead of wrapping lines at the window edge, which is the standard
behaviour of visual-line-mode, it wraps lines at fill-column.

If fill-column is too large for the window, the text is wrapped at the
window edge.

#+begin_src emacs-lisp

(use-package org
  :config

    (defun efs/org-mode-visual-fill ()
	(setq visual-fill-column-width 100
		visual-fill-column-center-text t)
	(visual-fill-column-mode 1)
    )

    (use-package visual-fill-column
      :hook (org-mode . efs/org-mode-visual-fill)
    )
)

#+end_src

** org agenda

#+begin_src emacs-lisp

(use-package org
  :config 

  ;; shows the completion logs in 
  ;; agenda view
  (setq org-agenda-start-with-log-mode t)

  ;; logs the time of the completion 
  ;; of a task
  (setq org-log-done 'time)

  ;; folds all the done logging 
  ;; into a single colalpsable drawer
  (setq org-log-into-drawer t)

  (setq
   org-agenda-files
'(
"~/.system-crafters/orgfiles/tasks.org"
"~/.system-crafters/orgfiles/birthdays.org"
)
  )
)

#+end_src

** org todo states

#+begin_src emacs-lisp

;; org todo states
(use-package org
  :config
  (setq org-todo-keywords
   '(
	(sequence
	"TODO(t)"
	"NEXT(n)"
	"|"
	"DONE(d)"
	)
	(sequence
	"BACKLOG(b)"
	"PLAN(p)"
	"ACTIVE(a)" 
	"REVIEW(v)"
	"WAIT(w@/!)"
	"|"
	"COMPLETED(c)"
	"CANCELED(k@)"
	)
    )
  )
)

#+end_src

** custom agenda views 

HELP!

working but...  I can't scroll down to see all the content in the
buffer that appear

#+begin_src emacs-lisp

(use-package org
  :config
    (setq org-agenda-custom-commands
    '(("d" "Dashboard"
	((agenda "" ((org-deadline-warning-days 7)))
	(todo "NEXT"
	    ((org-agenda-overriding-header "Next Tasks")))
	(tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	("n" "Next Tasks"
	((todo "NEXT"
	    ((org-agenda-overriding-header "Next Tasks")))))

	("W" "Work Tasks" tags-todo "+work-email")

	;; Low-effort next actions
	("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	((org-agenda-overriding-header "Low Effort Tasks")
	(org-agenda-max-todos 20)
	(org-agenda-files org-agenda-files)))

	("w" "Workflow Status"
	((todo "WAIT"
		((org-agenda-overriding-header "Waiting on External")
		(org-agenda-files org-agenda-files)))
	(todo "REVIEW"
		((org-agenda-overriding-header "In Review")
		(org-agenda-files org-agenda-files)))
	(todo "PLAN"
		((org-agenda-overriding-header "In Planning")
		(org-agenda-todo-list-sublevels nil)
		(org-agenda-files org-agenda-files)))
	(todo "BACKLOG"
		((org-agenda-overriding-header "Project Backlog")
		(org-agenda-todo-list-sublevels nil)
		(org-agenda-files org-agenda-files)))
	(todo "READY"
		((org-agenda-overriding-header "Ready for Work")
		(org-agenda-files org-agenda-files)))
	(todo "ACTIVE"
		((org-agenda-overriding-header "Active Projects")
		(org-agenda-files org-agenda-files)))
	(todo "COMPLETED"
		((org-agenda-overriding-header "Completed Projects")
		(org-agenda-files org-agenda-files)))
	(todo "CANC"
		((org-agenda-overriding-header "Cancelled Projects")
		(org-agenda-files org-agenda-files))))))
    )
)

#+end_src

** Tags

#+begin_src emacs-lisp
(use-package org
  :config
    ;; tags in org mode
    (setq org-tag-alist
	'(
	    (:startgroup)
	    ; Put mutually exclusive tags here
	    (:endgroup)
	    ("@errand" . ?E)
	    ("@home" . ?H)
	    ("@work" . ?W)
	    ("agenda" . ?a)
	    ("planning" . ?p)
	    ("publish" . ?P)
	    ("batch" . ?b)
	    ("note" . ?n)
	    ("idea" . ?i)
	)
    )
)

#+end_src

** org-refile

move DONE items ton archive file 

to move call:
=M-x org-refile=

#+begin_src emacs-lisp

(use-package org
  :config
  (setq org-refile-targets
	'(
	  ("archive.org" :maxlevel . 1)
	  ("tasks.org" :maxlevel . 1)
	  )
	)
  ;; save org buffers after refiling
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
)

#+end_src

** capture templates

to use it call:
=M-x org-capture=

#+begin_src emacs-lisp

(use-package org
  :config
  (setq org-capture-templates
   `(
	("t" "Tasks / Projects")
	("tt"
	"Task"
	entry (
	       file+olp
	       "~/.system-crafters/orgfiles/tasks.org"
	       "Inbox"
	)
	"* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1
	)

	("j" "Journal Entries")
	("jj" "Journal" entry
	    (file+olp+datetree "~/.system-crafters/orgfiles/journal.org")
	    "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
	    ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
	    :clock-in :clock-resume
	    :empty-lines 1)
	("jm" "Meeting" entry
	    (file+olp+datetree "~/.system-crafters/orgfiles/journal.org")
	    "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
	    :clock-in :clock-resume
	    :empty-lines 1)

	("w" "Workflows")
	("we"
	    "Checking Email"
	    entry (
		    file+olp+datetree "~/.system-crafters/orgfiles/journal.org"
	    )
	    "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1
	)

	("m" "Metrics Capture")
	("mw"
	    "Weight"
	    table-line (
		file+headline
		"~/.system-crafters/orgfiles/metrics.org"
		"Weight"
	    )
	"| %U | %^{Weight} | %^{Notes} |" :kill-buffer t
	)
 )
   )
)

#+end_src

** org habit

to use org habit: make a habits file: habits.org for example

make a TODO heading with a scheduled property

put a special property in the heading, with: =M-x org-set-property=, and
set it to: style : habit (the property name is style, the value of the
property is habit)

the result should be something like:

TODO brush teeth
SCHEDULED: <2021-12-30 Fri +1d>
:PROPERTIES:
:STYLE: habit
:END:

and add the file habits.org to the agenda files so it can show up in
the agenda

it shows a bar on the agenda view, showing whether or not you been
doing the habit

#+begin_src emacs-lisp

;; package org-habit
(use-package org
  :config
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
)

#+end_src

** Configure Babel Languages

#+begin_src emacs-lisp
      
(org-babel-do-load-languages
  'org-babel-load-languages
    '(
      (emacs-lisp . t)
      (python . t)
     )
)
;; adds unix config files as 
;; an accepted language 
(push '("conf-unix" . conf-unix) 
        org-src-lang-modes)

#+end_src

*** python command

to run code blocks in org mode: =C-c C-c=

#+begin_src emacs-lisp

(setq org-babel-python-command "python3")

#+end_src

*** disable confirmation before running

removes confirmation before running org-babel src blocks

#+begin_src emacs-lisp

(setq org-babel-confirm-evaluate nil)

#+end_src

** Auto Tangle Configuration Files

was not working initially, working after restarting editor

#+begin_src emacs-lisp
                
    ;; Automatically tangle our Emacs.org config file when we save it
    (defun efs/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
                          (expand-file-name "~/Projects/emacs_configs/system_crafters/emacs.org"))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))
    
    (add-hook 'org-mode-hook
              (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
               
#+end_src 
   
** structure templates
shortcut or "snippet" to create src blocks in org mode, with the
appropriate language

#+begin_src emacs-lisp

;; this is required as of Org 9.2
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
;; to use type on an org file, 
;; at the start of a line:
;; <el TAB

;; documentation for supported 
;; org-babel languages:
;; https://orgmode.org/worg/org-contrib/babel/languages/index.html

#+end_src

* Applications

It is possible to use emacs org-mode write to any file, not only lisp
code, here is a default config file for some app in the system that
uses a generic key = value pair for configuration

** Some App

#+begin_src conf
  value = 42
  value = "string"
#+end_src




* Part 8 - Build your own IDE with lsp-mode

* notes / tips & tricks
** make emacs update the changes made to an open buffer

Emacs by default don't update open buffers.

If a file is modified outside of emacs while a buffer is open on that
file, the changes wont show in emacs.

To show the changes you need to "revert" the buffer, which means
update the buffer to show the current contents of the file, and not
the "saved" version open on emacs.  Call command =M-x revert-buffer=

There is a minor mode that automatically reverts the buffers.  =M-x
auto-revert-mode=

** Evaluating lisp code in emacs

to evaluate lisp code inside emacs or not having to close emacs and
open it again to see the changes use =M-x eval-buffer= to evaluate the
current open document use =M-x eval-defun= to evaluate the function in
the line of the cursor

to evaluate a line use: =C-x C-e= with the cursor(point) on that line

** emacs package management

*** use package 
use package is like a package manager for emacs it makes it easier to
install packages

*** emacs default package manager
there is already a package manager built into emacs

*** view package status

use =M-x list-packages= to see all the
available/installed/built-in/incompatible packages the repository of
packages that packages are available by default is elpa.org

*** package archive contents
package-archive-contents is the variable that holds the links that
were setup earlier

**** TODO check back on the video 
check back on the video 
he talks about this to remember
what it does
  
** messages buffer

you can use the **messages** buffer to see the messages that poped up in
the line below the modeline

** describe function
   
=C-h f= calls describe function

** more options in ivy minibuffers
 
press M-o then chose one of the options to get more info on the item
selected

** set keybindings globally
to set a keybinding gloabally and "manually":

=(global-set-key (kbd "C-M-j")
   'counsel-switch-buffer)=

** set keybindings for specific modes
 
in case you want to change a keybind inside a given mode(major mode
only?)  start with: (define-key

followed by: 
=[name-of-mode]-map=
   =(kbd "[keys]")= =[command-to-bind-to]=

there are 2 ways to make this easier using :bind in use-package or
package: general.el

