system_crafters/init.el

    (defun efs/org-mode-visual-fill ()
	(setq visual-fill-column-width 100
		visual-fill-column-center-text t)
	(visual-fill-column-mode 1)
    )

    (use-package visual-fill-column
      :hook (org-mode . efs/org-mode-visual-fill)
    )
)

(use-package org
  :config 

  ;; shows the completion logs in 
  ;; agenda view
  (setq org-agenda-start-with-log-mode t)

  ;; logs the time of the completion 
  ;; of a task
  (setq org-log-done 'time)

  ;; folds all the done logging 
  ;; into a single colalpsable drawer
  (setq org-log-into-drawer t)

  (setq
   org-agenda-files
'(
"~/.system-crafters/orgfiles/tasks.org"
"~/.system-crafters/orgfiles/birthdays.org"
)
  )
)

;; org todo states
(use-package org
  :config
  (setq org-todo-keywords
   '(
	(sequence
	"TODO(t)"
	"NEXT(n)"
	"|"
	"DONE(d)"
	)
	(sequence
	"BACKLOG(b)"
	"PLAN(p)"
	"ACTIVE(a)" 
	"REVIEW(v)"
	"WAIT(w@/!)"
	"|"
	"COMPLETED(c)"
	"CANCELED(k@)"
	)
    )
  )
)

(use-package org
  :config
    (setq org-agenda-custom-commands
    '(("d" "Dashboard"
	((agenda "" ((org-deadline-warning-days 7)))
	(todo "NEXT"
	    ((org-agenda-overriding-header "Next Tasks")))
	(tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	("n" "Next Tasks"
	((todo "NEXT"
	    ((org-agenda-overriding-header "Next Tasks")))))

	("W" "Work Tasks" tags-todo "+work-email")

	;; Low-effort next actions
	("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	((org-agenda-overriding-header "Low Effort Tasks")
	(org-agenda-max-todos 20)
	(org-agenda-files org-agenda-files)))

	("w" "Workflow Status"
	((todo "WAIT"
		((org-agenda-overriding-header "Waiting on External")
		(org-agenda-files org-agenda-files)))
	(todo "REVIEW"
		((org-agenda-overriding-header "In Review")
		(org-agenda-files org-agenda-files)))
	(todo "PLAN"
		((org-agenda-overriding-header "In Planning")
		(org-agenda-todo-list-sublevels nil)
		(org-agenda-files org-agenda-files)))
	(todo "BACKLOG"
		((org-agenda-overriding-header "Project Backlog")
		(org-agenda-todo-list-sublevels nil)
		(org-agenda-files org-agenda-files)))
	(todo "READY"
		((org-agenda-overriding-header "Ready for Work")
		(org-agenda-files org-agenda-files)))
	(todo "ACTIVE"
		((org-agenda-overriding-header "Active Projects")
		(org-agenda-files org-agenda-files)))
	(todo "COMPLETED"
		((org-agenda-overriding-header "Completed Projects")
		(org-agenda-files org-agenda-files)))
	(todo "CANC"
		((org-agenda-overriding-header "Cancelled Projects")
		(org-agenda-files org-agenda-files))))))
    )
)

(use-package org
  :config
    ;; tags in org mode
    (setq org-tag-alist
	'(
	    (:startgroup)
	    ; Put mutually exclusive tags here
	    (:endgroup)
	    ("@errand" . ?E)
	    ("@home" . ?H)
	    ("@work" . ?W)
	    ("agenda" . ?a)
	    ("planning" . ?p)
	    ("publish" . ?P)
	    ("batch" . ?b)
	    ("note" . ?n)
	    ("idea" . ?i)
	)
    )
)

(use-package org
  :config
  (setq org-refile-targets
	'(
	  ("archive.org" :maxlevel . 1)
	  ("tasks.org" :maxlevel . 1)
	  )
	)
  ;; save org buffers after refiling
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
)

(use-package org
  :config
  (setq org-capture-templates
   `(
	("t" "Tasks / Projects")
	("tt"
	"Task"
	entry (
	       file+olp
	       "~/.system-crafters/orgfiles/tasks.org"
	       "Inbox"
	)
	"* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1
	)

	("j" "Journal Entries")
	("jj" "Journal" entry
	    (file+olp+datetree "~/.system-crafters/orgfiles/journal.org")
	    "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
	    ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
	    :clock-in :clock-resume
	    :empty-lines 1)
	("jm" "Meeting" entry
	    (file+olp+datetree "~/.system-crafters/orgfiles/journal.org")
	    "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
	    :clock-in :clock-resume
	    :empty-lines 1)

	("w" "Workflows")
	("we"
	    "Checking Email"
	    entry (
		    file+olp+datetree "~/.system-crafters/orgfiles/journal.org"
	    )
	    "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1
	)

	("m" "Metrics Capture")
	("mw"
	    "Weight"
	    table-line (
		file+headline
		"~/.system-crafters/orgfiles/metrics.org"
		"Weight"
	    )
	"| %U | %^{Weight} | %^{Notes} |" :kill-buffer t
	)
 )
   )
)

;; package org-habit
(use-package org
  :config
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
)

(org-babel-do-load-languages
  'org-babel-load-languages
    '(
      (emacs-lisp . t)
      (python . t)
     )
)
;; adds unix config files as 
;; an accepted language 
(push '("conf-unix" . conf-unix) 
        org-src-lang-modes)

(setq org-babel-python-command "python3")

(setq org-babel-confirm-evaluate nil)

;; Automatically tangle our Emacs.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/Projects/emacs_configs/system_crafters/emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

;; this is required as of Org 9.2
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
;; to use type on an org file, 
;; at the start of a line:
;; <el TAB

;; documentation for supported 
;; org-babel languages:
;; https://orgmode.org/worg/org-contrib/babel/languages/index.html
